#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Checkov 🧪`failure`

<details><summary>Show Plan</summary>


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.this[0] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "neubank-test-rg-eastus"
      + tags     = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.app_insights[0].azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "frontend-appinsights"
      + resource_group_name                   = "neubank-test-rg-eastus"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.app_insights[0].azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "neubank-test-rg-eastus"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.app_stack[0].azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "neubank-test-appserviceplan-eastus"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "neubank-test-rg-eastus"
      + sku_name                     = "P1v2"
      + tags                         = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + worker_count                 = (known after apply)
    }

  # module.app_stack[0].azurerm_windows_web_app.backend will be created
  + resource "azurerm_windows_web_app" "backend" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "neubank-test-backend-eastus"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "neubank-test-rg-eastus"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)
        }
    }

  # module.app_stack[0].azurerm_windows_web_app.frontend will be created
  + resource "azurerm_windows_web_app" "frontend" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "neubank-test-frontend-eastus"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "neubank-test-rg-eastus"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)
        }
    }

  # module.db[0].azurerm_mssql_managed_instance.db will be created
  + resource "azurerm_mssql_managed_instance" "db" {
      + administrator_login            = (known after apply)
      + administrator_login_password   = (sensitive value)
      + collation                      = "SQL_Latin1_General_CP1_CI_AS"
      + dns_zone                       = (known after apply)
      + fqdn                           = (known after apply)
      + id                             = (known after apply)
      + license_type                   = "BasePrice"
      + location                       = "eastus"
      + maintenance_configuration_name = "SQL_Default"
      + minimum_tls_version            = "1.2"
      + name                           = "neubank-test-managedmssql-eastus"
      + proxy_override                 = "Default"
      + public_data_endpoint_enabled   = false
      + resource_group_name            = "neubank-test-rg-eastus"
      + sku_name                       = "GP_Gen5"
      + storage_account_type           = "GRS"
      + storage_size_in_gb             = 32
      + subnet_id                      = (known after apply)
      + tags                           = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + timezone_id                    = "UTC"
      + vcores                         = 8
    }

  # module.db[0].azurerm_network_security_group.db will be created
  + resource "azurerm_network_security_group" "db" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = "neubank-test-rg-eastus"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.db[0].azurerm_route_table.db will be created
  + resource "azurerm_route_table" "db" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + resource_group_name           = "neubank-test-rg-eastus"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
    }

  # module.db[0].azurerm_subnet.db will be created
  + resource "azurerm_subnet" "db" {
      + address_prefixes                               = [
          + "10.0.3.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "neubank-test-rg-eastus"
      + virtual_network_name                           = "neubank-test-vnet-eastus"

      + delegation {
          + name = "managedinstancedelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Sql/managedInstances"
            }
        }
    }

  # module.db[0].azurerm_subnet_network_security_group_association.db will be created
  + resource "azurerm_subnet_network_security_group_association" "db" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.db[0].azurerm_subnet_route_table_association.db will be created
  + resource "azurerm_subnet_route_table_association" "db" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.db[0].random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.db[0].random_pet.db will be created
  + resource "random_pet" "db" {
      + id        = (known after apply)
      + length    = 1
      + separator = "-"
    }

  # module.network[0].azurerm_app_service_virtual_network_swift_connection.frontend will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "frontend" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network[0].azurerm_network_security_group.vnet will be created
  + resource "azurerm_network_security_group" "vnet" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "neubank-test-vnetnsg-eastus"
      + resource_group_name = "neubank-test-rg-eastus"
      + security_rule       = (known after apply)
    }

  # module.network[0].azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "neubank-test-rg-eastus"
      + tags                                                  = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.network[0].azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "neubank-test-vnet-eastus"
      + resource_group_name = "neubank-test-rg-eastus"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.storage[0].azurerm_private_endpoint.blob will be created
  + resource "azurerm_private_endpoint" "blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "neubank-test-stendpt-eastus"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "neubank-test-rg-eastus"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "example_psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage[0].azurerm_storage_account.blob will be created
  + resource "azurerm_storage_account" "blob" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "neubank-test-rg-eastus"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + delete_retention_policy {
              + days = 7
            }
        }

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }
    }

  # module.storage[0].azurerm_storage_blob.blob will be created
  + resource "azurerm_storage_blob" "blob" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "rr123.gif"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = (known after apply)
      + storage_container_name = "neubank-test-sc-eastus"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.storage[0].azurerm_storage_container.blob will be created
  + resource "azurerm_storage_container" "blob" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "neubank-test-sc-eastus"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # module.storage[0].random_string.sac will be created
  + resource "random_string" "sac" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.network[0].module.endpoints.azurerm_private_endpoint.backend will be created
  + resource "azurerm_private_endpoint" "backend" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "backwebappprivateendpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "neubank-test-rg-eastus"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatednszonegroup"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "privateendpointconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.network[0].module.subnets.azurerm_subnet.endpoint will be created
  + resource "azurerm_subnet" "endpoint" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "neubank-test-endpoint-subnet-eastus"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "neubank-test-rg-eastus"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "neubank-test-vnet-eastus"
    }

  # module.network[0].module.subnets.azurerm_subnet.integration will be created
  + resource "azurerm_subnet" "integration" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "neubank-test-integration-subnet-eastus"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "neubank-test-rg-eastus"
      + virtual_network_name                           = "neubank-test-vnet-eastus"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + name = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

</details>

<details><summary>Show Checkov Results</summary>

### terraform scan results:

|    | check_id      | file                             | resource                                                    | check_name                                                             | guideline                                                                                                              |
|----|---------------|----------------------------------|-------------------------------------------------------------|------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------------------|
|  0 | CKV2_AZURE_41 | /modules/storage/main.tf         | module.storage[0].azurerm_storage_account.blob              | Ensure storage account is configured with SAS expiration policy        | https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-iam-policies/bc-azure-2-41     |
|  1 | CKV2_AZURE_40 | /modules/storage/main.tf         | module.storage[0].azurerm_storage_account.blob              | Ensure storage account is not configured with Shared Key authorization | https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-iam-policies/bc-azure-2-40     |
|  2 | CKV2_AZURE_31 | /modules/network/subnets/main.tf | module.network[0].module.subnets.azurerm_subnet.endpoint    | Ensure VNET subnet is configured with a Network Security Group (NSG)   | https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-general-policies/bc-azure-2-31 |
|  3 | CKV2_AZURE_31 | /modules/network/subnets/main.tf | module.network[0].module.subnets.azurerm_subnet.integration | Ensure VNET subnet is configured with a Network Security Group (NSG)   | https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-general-policies/bc-azure-2-31 |

---

</details>

*Pusher: @dbwest, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Test`*